# -----------------------------------------------------------
# Filename: 字符串格式化
# Author: Luk4sy
# Date: 2023/6/12
#
# Description: 
# -----------------------------------------------------------

# 占位符

name = "Luk4sy"
id = 1811
message = "姓名:%s,id: %d" % (name, id)
print(message)

# 常用的展位
# %s string类型
# %d int整型
# %f float浮点型

print("_____________________")
# 精度控制
num1 = 11
num2 = 11.345
print("数字11宽度限制5，结果是:%5d" % num1)
print("数字11宽度限制11，结果是:%1d" % num1)
print("数字11.345宽度限制7，小数精度为2，结果为:%7.2f" % num2)
print("驻地11.345不限制，小数精度为2，结果为：%.2f" % num2)
